testsuite_results/sysbench/results/oltp_delete.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 8498.80 qps: 8498.80 (r/w/o: 0.00/6659.57/1839.23) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 8848.91 qps: 8848.91 (r/w/o: 0.00/4464.46/4384.46) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 9530.56 qps: 9530.56 (r/w/o: 0.00/3351.35/6179.21) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           283237
        other:                           260567
        total:                           543804
    transactions:                        543804 (9060.71 per sec.)
    queries:                             543804 (9060.71 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      9060.7126
    time elapsed:                        60.0179s
    total number of events:              543804

Latency (ms):
         min:                                    3.02
         avg:                                   14.13
         max:                                   50.54
         95th percentile:                       17.63
         sum:                              7681317.27

Threads fairness:
    events (avg/stddev):           4248.4688/8.90
    execution time (avg/stddev):   60.0103/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 10057.84 qps: 10057.84 (r/w/o: 0.00/2162.32/7895.52) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 10660.51 qps: 10660.51 (r/w/o: 0.00/1366.65/9293.86) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 11213.34 qps: 11213.34 (r/w/o: 0.00/931.10/10282.24) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           85222
        other:                           555644
        total:                           640866
    transactions:                        640866 (10677.58 per sec.)
    queries:                             640866 (10677.58 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      10677.5774
    time elapsed:                        60.0217s
    total number of events:              640866

Latency (ms):
         min:                                    3.06
         avg:                                   11.99
         max:                                   45.45
         95th percentile:                       15.00
         sum:                              7681721.90

Threads fairness:
    events (avg/stddev):           5006.7500/15.46
    execution time (avg/stddev):   60.0135/0.00